Imports

In [218]:
from pathlib import *
import pandas as pd
import os






test = pd.read_csv("data/roster.csv")
test
test.columns

Index(['Student name', 'ID'], dtype='object')

In [219]:
test.columns

Index(['Student name', 'ID'], dtype='object')

Reading the student and identity codes file using pd.read_csv()

In [220]:
# HERE = os.path.join(os.path.dirname(__file__), '..')

# DATA_FOLDER = HERE  +"\data"


roster = pd.read_csv(
    "data/roster.csv",
    # converters={"NetID": str.lower, "Email Address": str.lower},
    usecols=["Student name", "ID"],
    # Set index
    index_col=["ID", "Student name"],
)

In [221]:
Test_quiz = pd.read_csv("data/quiz__grades.csv")
Test_quiz.head()

      Student name       ID  Chem Quiz  Bio Quiz  Phy Quiz  Math Quiz
0       Bett James  GR-0483        127       184        52        133
1  Namukolo Abrams  GR-0484        141       177        21        136
2       Vera Abutu  GR-0485         51       112        61         74
3       Kwame Doga  GR-0486         26       133        62         86
4    Lukeman Ahmad  GR-0487         29        21       177         50

In [222]:
# from utils import file_path

# quiz_name = " ".join({})
quiz_grades = pd.DataFrame()

quiz = pd.read_csv(
     "data/quiz__grades.csv",
     index_col= ["ID", "Student name"],
     usecols=["Student name", "ID", "Chem Quiz", "Bio Quiz", "Phy Quiz", "Math Quiz"]



)
quiz_grades = pd.concat([quiz_grades, quiz], axis=0)
quiz_grades.head()

                         Chem Quiz  Bio Quiz  Phy Quiz  Math Quiz
ID      Student name
GR-0483 Bett James             127       184        52        133
GR-0484 Namukolo Abrams        141       177        21        136
GR-0485 Vera Abutu              51       112        61         74
GR-0486 Kwame Doga              26       133        62         86
GR-0487 Lukeman Ahmad           29        21       177         50

In [223]:
hw_exam_grades = pd.read_csv(
    "data/homework.csv",
    usecols= lambda x: "Submission" not in x,
    index_col=["ID",  "Student name"],
)
hw_exam_grades.head()

                         Chem HW  Bio HW  Phy HW  Math HW
ID      Student name
GR-0483 Bett James           135     186     142       97
GR-0484 Namukolo Abrams       82     170      12      180
GR-0485 Vera Abutu           102      55     105       50
GR-0486 Kwame Doga           166     108      59      181
GR-0487 Lukeman Ahmad        180     123      11       18

In [224]:
hw_exam_grades["Chem HW"].head()

ID       Student name
GR-0483  Bett James         135
GR-0484  Namukolo Abrams     82
GR-0485  Vera Abutu         102
GR-0486  Kwame Doga         166
GR-0487  Lukeman Ahmad      180
Name: Chem HW, dtype: int64

In [225]:
attendance = pd.read_csv(
    "data/Attendance.csv",
    usecols=["Student name", "ID", "Chem", "Bio", "Phy", "Math"],
    index_col=["ID", "Student name"]
).rename(columns={"Chem": "Chem Atnd", "Bio": "Bio Atnd", "Phy": "Phy Atnd", "Math": "Math Atnd"})

In [226]:
attendance

                         Chem Atnd  Bio Atnd  Phy Atnd  Math Atnd
ID      Student name
GR-0483 Bett James              17        58        29         34
GR-0484 Namukolo Abrams         95        57        43         48
GR-0485 Vera Abutu              96        71        83         93
GR-0486 Kwame Doga              75        52        94         66
GR-0487 Lukeman Ahmad           38        47        38         34
GR-0488 Akin Torey              26        88        37         14
GR-0489 Luke Brant              91        51        93         22
GR-0490 James Kenyata           39        13        90         25
GR-0491 Ngugi Tionga            14        42        70         36
GR-0492 Okoro Eze               31        58        54         71
GR-0493 Agatha Chiluba          67        64        86         55
GR-0494 Mangu Joseph            82        87        63         13
GR-0495 Longe Jethro            48        92        65         50
GR-0496 Florence Giwa           30        36        24         18
GR-0497 Vetiva Lucent           48        48        84         73
GR-0498 Melody Braimoh          68        38        43         36
GR-0499 Victor Ihab             83        51        50         63
GR-0500 Mimi Trucker            80        41        73         44
GR-0501 Maguel Peter            63        28        80         95
GR-0502 Wellington Zuba         92        19        88         94

Loading the Quiz Files

In [227]:
Exam = pd.read_csv(
    "data/Exam.csv",
    usecols=["Student name", "ID", "Chem", "Bio", "Phy", "Math"],
    index_col=["ID", "Student name"]
).rename(columns={"Chem": "Chem Exam", "Bio": "Bio Exam", "Phy": "Phy Exam", "Math": "Math Exam"})

In [228]:
Exam.head()

                         Chem Exam  Bio Exam  Phy Exam  Math Exam
ID      Student name
GR-0483 Bett James              46        97        73         45
GR-0484 Namukolo Abrams         52        41        31         31
GR-0485 Vera Abutu              24        51        98         94
GR-0486 Kwame Doga              73        68        65         67
GR-0487 Lukeman Ahmad           80        90        51         68

Merging

In [229]:
final_data = pd.merge(
    roster, hw_exam_grades, left_index= True, right_index=True,
)
final_data.head()

                         Chem HW  Bio HW  Phy HW  Math HW
ID      Student name
GR-0483 Bett James           135     186     142       97
GR-0484 Namukolo Abrams       82     170      12      180
GR-0485 Vera Abutu           102      55     105       50
GR-0486 Kwame Doga           166     108      59      181
GR-0487 Lukeman Ahmad        180     123      11       18

In [230]:
final_data = pd.merge(
    final_data, quiz_grades, left_index=True, right_index=True,
)

In [231]:
final_data = pd.merge(
    final_data, attendance, left_index=True, right_index=True,
)

In [232]:
final_data.head()

,,Chem HW,Bio HW,Phy HW,Math HW,Chem Quiz,Bio Quiz,Phy Quiz,Math Quiz,Chem Atnd,Bio Atnd,Phy Atnd,Math Atnd
ID,Student name,,,,,,,,,,,,
GR-0483,Bett James,135,186,142,97,127,184,52,133,17,58,29,34
GR-0484,Namukolo Abrams,82,170,12,180,141,177,21,136,95,57,43,48
GR-0485,Vera Abutu,102,55,105,50,51,112,61,74,96,71,83,93
GR-0486,Kwame Doga,166,108,59,181,26,133,62,86,75,52,94,66
GR-0487,Lukeman Ahmad,180,123,11,18,29,21,177,50,38,47,38,34

In [233]:
final_data = pd.merge(
    final_data, Exam, left_index=True, right_index=True,
)

In [234]:
final_data.head()

,,Chem HW,Bio HW,Phy HW,Math HW,Chem Quiz,Bio Quiz,Phy Quiz,Math Quiz,Chem Atnd,Bio Atnd,Phy Atnd,Math Atnd,Chem Exam,Bio Exam,Phy Exam,Math Exam
ID,Student name,,,,,,,,,,,,,,,,
GR-0483,Bett James,135,186,142,97,127,184,52,133,17,58,29,34,46,97,73,45
GR-0484,Namukolo Abrams,82,170,12,180,141,177,21,136,95,57,43,48,52,41,31,31
GR-0485,Vera Abutu,102,55,105,50,51,112,61,74,96,71,83,93,24,51,98,94
GR-0486,Kwame Doga,166,108,59,181,26,133,62,86,75,52,94,66,73,68,65,67
GR-0487,Lukeman Ahmad,180,123,11,18,29,21,177,50,38,47,38,34,80,90,51,68